app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["name", "Start-Up Projects"], ["updated_at", Sun, 14 Sep 2014 18:02:36 UTC +00:00]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update(project_params)

INSERT INTO "projects" ("created_at", "description", "image_file_name", "name", "pledging_ends_on", "target_pledge_amount", "team_members", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    if @project.save